In [84]:
import pandas as pd
import numpy as np

In [4]:
#df oluşturma ve satırlara isim verme
df_1=pd.DataFrame(
   { 
    "a": [4, 5, 6],
    "b": [7, 8, 9],
    "c":[10, 11, 12]
    },
   index=[1, 2, 3]
    
)

In [5]:
df_1

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [9]:
#Aynı görüntüyü kolon isimlerini vererekte yapabiliriz
df_2=pd.DataFrame(
    
    [[4, 5, 6],
     [7, 8, 9],
     [10, 11, 12]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c']
)

In [10]:
df_2

    a   b   c
1   4   5   6
2   7   8   9
3  10  11  12

In [20]:
df_3=pd.DataFrame(
    {"a": [4, 5, 6],
    "b": [7, 8, 9],
    "c":[10, 11, 12]},
    
    index=pd.MultiIndex.from_tuples(
        [('d', 1), ('d', 2), ('e', 2)],
        names=['n', 'v']
    )   
)

In [21]:
df_3

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [69]:
df_3.loc['d']

   a  b   c
v
1  4  7  10
2  5  8  11

# Reshaping Data-Verilerin Yeniden Şekillendirilmesi

# melt(): sütunları satırlara dönüştürerek verileri yeniden şekillendirir

In [23]:

pd.melt(df_1)

  variable  value
0        a      4
1        a      5
2        a      6
3        b      7
4        b      8
5        b      9
6        c     10
7        c     11
8        c     12

In [24]:
pd.melt(df_3)

  variable  value
0        a      4
1        a      5
2        a      6
3        b      7
4        b      8
5        b      9
6        c     10
7        c     11
8        c     12

# pivot(): satırları sütunlara dönüştürerek verileri yeniden şekillendirir.

In [26]:
country_df=pd.DataFrame(
    {
        'Country': ['USA', 'USA', 'Canada', 'Canada'],
        'Year': [2018, 2019, 2018, 2019],
        'GDP': [20.4, 21.4, 15.3, 16.2]
    }
)

In [28]:
pivot_df = country_df.pivot(index='Year', columns='Country', values='GDP')
pivot_df

Country  Canada   USA
Year
2018       15.3  20.4
2019       16.2  21.4

In [33]:
# creating the DataFrames
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})
display('df1:', df1)
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7']})
display('df2:', df2)

'df1:'

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

'df2:'

    A   B
0  A4  B4
1  A5  B5
2  A6  B6
3  A7  B7

In [34]:
# concatenating
display('After concatenating:')
display(pd.concat([df1, df2],
                  keys=['key1', 'key2']))

'After concatenating:'

         A   B
key1 0  A0  B0
     1  A1  B1
     2  A2  B2
     3  A3  B3
key2 0  A4  B4
     1  A5  B5
     2  A6  B6
     3  A7  B7

In [37]:
# concatenating
display('After concatenating:')
display(pd.concat([df1, df2], 
                  ignore_index = True)) #axis=0

'After concatenating:'

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4
5  A5  B5
6  A6  B6
7  A7  B7

In [42]:
# concatenating
#axis=1 olduğu için yan yana sütunları yazdırdı
#ignore_index: her satırın artarak numaralandırılmasına izin verir.
display('After concatenating:')
display(pd.concat([df1, df2], axis=1))

'After concatenating:'

    A   B   A   B
0  A0  B0  A4  B4
1  A1  B1  A5  B5
2  A2  B2  A6  B6
3  A3  B3  A7  B7

In [45]:
country_df.rename(columns={'Year': 'Yıl'})

  Country   Yıl   GDP
0     USA  2018  20.4
1     USA  2019  21.4
2  Canada  2018  15.3
3  Canada  2019  16.2

In [49]:
print(df_1)
df_1.reset_index()

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

   index  a  b   c
0      1  4  7  10
1      2  5  8  11
2      3  6  9  12

In [51]:
df_1.drop(columns=['a'])

   b   c
1  7  10
2  8  11
3  9  12

In [54]:
df_1.iat[0, 2] #x=0 y=2

10

In [68]:
country_df.loc[0]

Country     USA
Year       2018
GDP        20.4
Name: 0, dtype: object

In [55]:
country_df.loc[:]

  Country  Year   GDP
0     USA  2018  20.4
1     USA  2019  21.4
2  Canada  2018  15.3
3  Canada  2019  16.2

In [59]:
country_df.loc[0:2] #1. satırdan 2.satıra kadar

  Country  Year   GDP
0     USA  2018  20.4
1     USA  2019  21.4
2  Canada  2018  15.3

In [60]:
country_df.loc[1:3]#1. satırdan 3. satıra kadar

  Country  Year   GDP
1     USA  2019  21.4
2  Canada  2018  15.3
3  Canada  2019  16.2

# drop_dublicates():Yinelenen satırları kaldırır

In [61]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [62]:
df.drop_duplicates() #1. satır silindi

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [63]:
df[['brand']]

     brand
0  Yum Yum
1  Yum Yum
2  Indomie
3  Indomie
4  Indomie

In [71]:
df.groupby("brand").size()#gruplama

brand
Indomie    3
Yum Yum    2
dtype: int64

In [72]:
country_df.Year.sort_values()#sıralama

0    2018
2    2018
1    2019
3    2019
Name: Year, dtype: int64

In [100]:
adf=pd.DataFrame(
    {
        "x1": ['A', 'B', 'C'],
        "x2": [1, 2, 3]
    },
)
adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [102]:
bdf=pd.DataFrame(
    {
        "x1": ['A', 'B', 'D'],
        "x3": ['T', 'F', 'T']
    },
)
bdf

  x1 x3
0  A  T
1  B  F
2  D  T

In [103]:
pd.merge(adf, bdf, 
         how='left', on='x1')#sol tablodaki x1

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

In [104]:
pd.merge(adf, bdf, 
         how='right', on='x1') #sağ tablodaki x1

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

In [105]:
pd.merge(adf, bdf,
         how='inner', on='x1') #kesişim

  x1  x2 x3
0  A   1  T
1  B   2  F

In [106]:
pd.merge(adf, bdf,
         how='outer', on='x1') #tüm değerler

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

In [107]:
#adf'de , bdf'de eşleşen tüm satırlar.
adf[adf.x1.isin(bdf.x1)]

  x1  x2
0  A   1
1  B   2

In [108]:
#adf'de, bdf'de eşleşme olmayan tüm satırlar.
adf[~adf.x1.isin(bdf.x1)]

  x1  x2
2  C   3